reports/k6-raw-output.txt


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=17.31ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 291     13.944959/s
    checks_succeeded...: 100.00% 291 out of 291
    checks_failed......: 0.00%   0 out of 291

    ✓ status is 200
    ✓ response time ok
    ✓ has content

    HTTP
    http_req_duration..............: avg=23.51ms min=9.26ms med=12.65ms max=296.68ms p(90)=15.8ms p(95)=17.31ms
      { expected_response:true }...: avg=23.51ms min=9.26ms med=12.65ms max=296.68ms p(90)=15.8ms p(95)=17.31ms
    http_req_failed................: 0.00%  0 out of 194
    http_reqs......................: 194    9.296639/s

    EXECUTION
    iteration_duration.............: avg=1.05s   min=1.02s  med=1.02s   max=1.52s    p(90)=1.04s  p(95)=1.11s  
    iterations.....................: 97     4.64832/s
    vus............................: 5      min=5        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 166 kB 8.0 kB/s
    data_sent......................: 17 kB  804 B/s